In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
csv_in = 'baseball_shop.csv'
df_baseball = pd.read_csv(csv_in,sep=',',skiprows=0,header=0)
print(df_baseball.shape)
print(df_baseball.info())
display(df_baseball.head())

(376, 5)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 376 entries, 0 to 375
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   ShopID   376 non-null    int64
 1   Pref     376 non-null    object
 2   Product  376 non-null    object
 3   Price    376 non-null    int64
 4   Amount   376 non-null    int64
dtypes: int64(3), object(2)
memory usage: 14.8+ KB
None

   ShopID      Pref  Product  Price  Amount
0      18  Kanagawa      BAT  13800      10
1      18  Kanagawa  UNIFORM  11800      12
2      18  Kanagawa    GLOVE  16700      10
3      18  Kanagawa    SHOES  12800      10
4      30   Ibaraki      BAT  13800       8

In [3]:
print(df_baseball['Pref'].value_counts())

Kanagawa    68
Tokyo       68
Chiba       64
Ibaraki     48
Saitama     48
Tochigi     40
Gunma       40
Name: Pref, dtype: int64

In [4]:
df_baseball2 = pd.crosstab(df_baseball['Pref'],df_baseball['Product'],margins=True)
display(df_baseball2)

Product   BAT  GLOVE  SHOES  UNIFORM  All
Pref
Chiba      16     16     16       16   64
Gunma      10     10     10       10   40
Ibaraki    12     12     12       12   48
Kanagawa   17     17     17       17   68
Saitama    12     12     12       12   48
Tochigi    10     10     10       10   40
Tokyo      17     17     17       17   68
All        94     94     94       94  376

In [5]:
print(df_baseball2.sum(axis=1))

Pref
Chiba       128
Gunma        80
Ibaraki      96
Kanagawa    136
Saitama      96
Tochigi      80
Tokyo       136
All         752
dtype: int64

In [6]:
display(df_baseball.pivot_table(index='Pref',columns='Product',values=['Amount'],aggfunc=np.mean))

            Amount
Product        BAT      GLOVE     SHOES   UNIFORM
Pref
Chiba     4.375000   5.562500  6.625000  8.125000
Gunma     6.800000   8.400000  7.500000  6.100000
Ibaraki   6.583333   5.750000  7.333333  8.083333
Kanagawa  5.529412   5.705882  7.235294  6.588235
Saitama   7.416667   7.500000  8.583333  8.666667
Tochigi   5.500000   4.300000  6.100000  8.800000
Tokyo     9.235294  10.000000  9.823529  9.352941